src/DataProcessors/ГрупповаяОбработкаТехОперацийДД/ГрупповаяОбработкаТехОперацийДД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповаяОбработкаТехОперацийДД</name>
  <attributes>
    <name>ВноситьНаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыЭлементовНормРасходов/ВидыЭлементовНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовНормРасходов</name>
  <enumValues>
    <name>Деталь</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>МатериалВспомогательный</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>Основа</name>
  </enumValues>
  <enumValues>
    <name>Программа</name>
  </enumValues>
  <enumValues>
    <name>ТехОперация</name>
  </enumValues>
  <enumValues>
    <name>ТехОснастка</name>
  </enumValues>
  <enumValues>
    <name>Узел</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/РабочиеМестаЛинеек/РабочиеМестаЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМестаЛинеек</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторизовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗаданийПоВремениПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРабочихМест</name>
    <type>
      <types>CatalogRef.ГруппыРабочихМест</types>
    </type>
  </attributes>
  <attributes>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированиемВТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаканчиватьПредыдущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводBT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБуфер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьТехОснастку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ГрупповаяОбработкаТехОперацийДД/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.ВноситьНаДату = НачалоМесяца(ТекущаяДата())
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СписокЛинеек.Количество() > 0 Тогда
	СписокЛинеекПриИзмененииНаСервере();
	КонецЕсли; 
ТаблицаТехОперацийСпецификации.Параметры.УстановитьЗначениеПараметра("ВидЭлемента",ПолучитьВидЭлементаТО());
ТаблицаТехОперацийСпецификации.Параметры.УстановитьЗначениеПараметра("МПЗ",Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаТехОпераций Цикл
		Если Не ТЧ.ТехОперация.Пустая() Тогда
		ТЧ.Пометка = Истина; 
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаТехОпераций Цикл
	ТЧ.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе1(Команда)
	Для каждого ТЧ Из ТаблицаТехОперацийСпецификации Цикл
	ТЧ.Пометка = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе1(Команда)
	Для каждого ТЧ Из ТаблицаТехОперацийСпецификации Цикл
	ТЧ.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура СписокЛинеекПриИзмененииНаСервере()
ТаблицаТехОпераций.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеекТехОперации.ТехОперация,
	|	РабочиеМестаЛинеекТехОперации.Ссылка
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек.ТехОперации КАК РабочиеМестаЛинеекТехОперации
	|ГДЕ
	|	РабочиеМестаЛинеекТехОперации.Ссылка.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМестаЛинеекТехОперации.Ссылка.Код";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ_ТО = ТаблицаТехОпераций.Добавить();
	ТЧ_ТО.Линейка = ВыборкаДетальныеЗаписи.Ссылка.Линейка;
	ТЧ_ТО.РабочееМесто = ВыборкаДетальныеЗаписи.Ссылка;
		Если ВыборкаДетальныеЗаписи.ТехОперация.ЭтоГруппа Тогда
		ТЧ_ТО.ГруппаТО = ВыборкаДетальныеЗаписи.ТехОперация;
		Иначе
		ТЧ_ТО.ТехОперация = ВыборкаДетальныеЗаписи.ТехОперация;
		ТЧ_ТО.НормаВремени = ПолучитьНормуВремени(ВыборкаДетальныеЗаписи.ТехОперация);
		КонецЕсли;
	КонецЦикла;
ТаблицаТехОпераций.Сортировать("Линейка");
СписокВидовКанбанов.Очистить();
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛинейкиВидыКанбанов.ВидКанбана
	|ИЗ
	|	Справочник.Линейки.ВидыКанбанов КАК ЛинейкиВидыКанбанов
	|ГДЕ
	|	ЛинейкиВидыКанбанов.Ссылка В ИЕРАРХИИ(&СписокЛинеек)";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокВидовКанбанов.Добавить(ВыборкаДетальныеЗаписи.ВидКанбана);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокЛинеекПриИзменении(Элемент)
СписокЛинеекПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьВидЭлементаТО()
Возврат(Перечисления.ВидыЭлементовНормРасходов.ТехОперация);
КонецФункции

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации)
ВыборкаНР =  ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(ЭтапСпецификации,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаНР.Элемент.Канбан) Тогда
			Если СписокВидовКанбанов.НайтиПоЗначению(ВыборкаНР.Элемент.Канбан) <> Неопределено Тогда
			СписокМПЗ.Добавить(ВыборкаНР.Элемент);
			КонецЕсли;
		КонецЕсли;
	РаскрытьНаМПЗ(ВыборкаНР.Элемент);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокПФ(Изделие)
СписокМПЗ.Очистить();
СписокМПЗ.Добавить(Изделие);	
РаскрытьНаМПЗ(Изделие);
КонецПроцедуры 

&НаСервере
Функция ТОСуществует(Спецификация,ТО)
Запрос = Новый Запрос;
Результат = Новый Структура("НормРасх,Норма",Неопределено,0); 

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Ссылка КАК Ссылка,
	|	НормыРасходовСрезПоследних.Норма КАК Норма
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.Владелец = &Владелец
	|	И НормыРасходов.Элемент = &Элемент
	|	И НормыРасходов.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("Владелец", Спецификация);
Запрос.УстановитьПараметр("Элемент", ТО);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Результат.НормРасх = ВыборкаДетальныеЗаписи.Ссылка;
	Результат.Норма = ВыборкаДетальныеЗаписи.Норма;
	КонецЦикла;
Возврат(Результат);
КонецФункции

&НаСервере
Процедура ДобавитьТО(Спецификация,ТО)
Результат = ТОСуществует(Спецификация,ТО);	
	Если Результат.НормРасх = Неопределено Тогда
	НР = Справочники.НормыРасходов.СоздатьЭлемент();
	НР.Владелец = Спецификация;
	НР.Наименование = "Тех. операции, "+СокрЛП(ТО.Наименование);
	НР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.ТехОперация;
	НР.Элемент = ТО;
	НР.Записать();
	РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
	РНР.Период = НачалоМесяца(Объект.ВноситьНаДату);
	РНР.Владелец = НР.Владелец;
	РНР.Элемент = НР.Элемент;
	РНР.НормаРасходов = НР.Ссылка;
	РНР.Норма = 1;
	РНР.Записать(Истина);
	ИначеЕсли Результат.Норма = 0 Тогда
	РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
	РНР.Период = НачалоМесяца(Объект.ВноситьНаДату);
	РНР.Владелец = Результат.НормРасх.Владелец;
	РНР.Элемент = Результат.НормРасх.Элемент;
	РНР.НормаРасходов = Результат.НормРасх;
	РНР.Норма = 1;
	РНР.Записать(Истина);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ДобавитьВСпецификацииНаСервере(Спецификация)
	Для каждого ТЧ Из ТаблицаТехОпераций Цикл
		Если ТЧ.Пометка Тогда
		ДобавитьТО(Спецификация,ТЧ.ТехОперация);
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСпецификации(Команда)
ДобавитьВСпецификацииНаСервере(Элементы.СписокМПЗ.ТекущиеДанные.Значение);
ТаблицаТехОперацийСпецификации.Параметры.УстановитьЗначениеПараметра("ВидЭлемента",ПолучитьВидЭлементаТО());
ПолучитьСписокПФ(Элементы.СписокНоменклатуры.ТекущиеДанные.Значение);
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуру(НаименованиеТовара)
Товар = Справочники.Товары.НайтиПоНаименованию(НаименованиеТовара,Истина);
	Если Не Товар.Пустая() Тогда
	флНайдена = Ложь;
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Товар = &Товар";
	Запрос.УстановитьПараметр("Товар", Товар);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		флНайдена = Истина;
		Прервать;
		КонецЦикла;
			Если Не флНайдена Тогда
			Сообщить(НаименованиеТовара +" - спецификация не найдена!");	
			КонецЕсли; 
	Иначе
	Сообщить(НаименованиеТовара +" - товар не найден!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
СписокНоменклатуры.Очистить();
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c номенклатурой");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка номенклатуры из файла..."); 
		ДобавитьНоменклатуру(СокрЛП(ExcelЛист.Cells(к,1).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТО(ГруппаТО)
СписокТО = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТехОперации.Ссылка
	|ИЗ
	|	Справочник.ТехОперации КАК ТехОперации
	|ГДЕ
	|	ТехОперации.Родитель = &Родитель";
Запрос.УстановитьПараметр("Родитель", ГруппаТО);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокТО.Добавить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(СписокТО);
КонецФункции 

&НаКлиенте
Процедура Обновить(Команда)
СписокЛинеекПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьНормуВремени(ТО)
Возврат(РегистрыСведений.НормыТО.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ТехОперация",ТО)).Норма);
КонецФункции 

&НаКлиенте
Процедура ТаблицаТехОперацийТехОперацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
	Если Не Элементы.ТаблицаТехОпераций.ТекущиеДанные.ГруппаТО.Пустая() Тогда
	СписокТО = ПолучитьСписокТО(Элементы.ТаблицаТехОпераций.ТекущиеДанные.ГруппаТО);
		Если СписокТО.Количество() > 0 Тогда
		ТО = Неопределено;
		ТО = СписокТО.ВыбратьЭлемент("Выберите тех. операцию",ТО);
			Если ТО <> Неопределено Тогда
			Элементы.ТаблицаТехОпераций.ТекущиеДанные.Пометка = Истина;
			Элементы.ТаблицаТехОпераций.ТекущиеДанные.ТехОперация = ТО.Значение;
			Элементы.ТаблицаТехОпераций.ТекущиеДанные.НормаВремени = ПолучитьНормуВремени(ТО.Значение);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриИзменении(Элемент)
	Если СписокНоменклатуры.Количество() > 0 Тогда
		Если Не Элементы.СписокНоменклатуры.ТекущиеДанные.Значение.Пустая() Тогда
		ПолучитьСписокПФ(Элементы.СписокНоменклатуры.ТекущиеДанные.Значение);
		Элементы.СписокМПЗ.ТекущаяСтрока = СписокМПЗ[0].ПолучитьИдентификатор();
		СписокМПЗВыборЗначения(Элементы.СписокМПЗ.ТекущаяСтрока,,Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если Не Элементы.СписокНоменклатуры.ТекущиеДанные.Значение.Пустая() Тогда
	ПолучитьСписокПФ(Элементы.СписокНоменклатуры.ТекущиеДанные.Значение);
	Элементы.СписокМПЗ.ТекущаяСтрока = СписокМПЗ[0].ПолучитьИдентификатор();
	СписокМПЗВыборЗначения(Элементы.СписокМПЗ.ТекущаяСтрока,,Истина);
	СписокЛинеекПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокМПЗВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ТаблицаТехОперацийСпецификации.Параметры.УстановитьЗначениеПараметра("ВидЭлемента",ПолучитьВидЭлементаТО());
ТаблицаТехОперацийСпецификации.Параметры.УстановитьЗначениеПараметра("МПЗ",Элементы.СписокМПЗ.ТекущиеДанные.Значение);
СписокЛинеекПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТехОперацийПометкаПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Элементы.ТаблицаТехОпераций.ТекущиеДанные.ТехОперация) Тогда
	Элементы.ТаблицаТехОпераций.ТекущиеДанные.Пометка = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТехОперацийТехОперацияПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Элементы.ТаблицаТехОпераций.ТекущиеДанные.ТехОперация) Тогда
	Элементы.ТаблицаТехОпераций.ТекущиеДанные.Пометка = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ИзменитьНормуРасхода(НР,Количество)
РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
РНР.Период = Объект.ВноситьНаДату;
РНР.Владелец = НР.Владелец;
РНР.Элемент = НР.Элемент;
РНР.НормаРасходов = НР;
РНР.Норма = Количество;
РНР.Записать(Истина);
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаТехОперацийСпецификацииПередНачаломИзменения(Элемент, Отказ)
Отказ = Истина;
ВыбКоличество = 0;
	Если ВвестиЧисло(ВыбКоличество,"Введите кол-во тех. операции",7,3) Тогда	
	ИзменитьНормуРасхода(Элемент.ТекущаяСтрока,ВыбКоличество);
	Элементы.ТаблицаТехОперацийСпецификации.Обновить();
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ОбнулитьКоличествоНаСервере(НР,НаДату)
РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
РНР.Период = НаДату;   
РНР.Владелец = НР.Владелец;
РНР.Элемент = НР.Элемент;
РНР.НормаРасходов = НР;
РНР.Норма = 0;
РНР.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьКоличество(Команда)
НаДату = ТекущаяДата();
	Если ВвестиДату(НаДату,"Обнулить на дату",ЧастиДаты.Дата) Тогда
	ОбнулитьКоличествоНаСервере(Элементы.ТаблицаТехОперацийСпецификации.ТекущаяСтрока,НаДату);
	Элементы.ТаблицаТехОперацийСпецификации.Обновить();
	КонецЕсли; 
КонецПроцедуры
